# Core
brew "stow"
brew "git"
brew "gh"
brew "glab"
brew "curl"
brew "wget"

# Shell
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "fzf"
brew "zoxide"
brew "direnv"
brew "atuin"

# Modern CLI
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "delta"
brew "btop"
brew "htop"
brew "jq"
brew "yq"
brew "watch"
brew "tree"

# Git
brew "lazygit"
brew "gitleaks"

# Dev
brew "neovim"
brew "tmux"
brew "tree-sitter"
brew "mise"
brew "topgrade"
brew "yazi"
brew "uv"
brew "pipx"
brew "go"

# DevOps
brew "hashicorp/tap/terraform"
brew "helm"
brew "derailed/k9s/k9s"
brew "kind"
brew "kubeseal"
brew "argocd"
brew "sops"
brew "gnupg"
brew "nmap"
brew "mtr"

# Cloud
cask "gcloud-cli" if OS.mac?

# Networking
brew "inetutils"
brew "netcat"
brew "telnet"

# Fonts (macOS)
cask "font-jetbrains-mono" if OS.mac?

# Terminal (macOS)
cask "ghostty" if OS.mac?
